Repository: MaxCode2023/nopaper-sdk-ios
Catalog: myDSSSDK.xcframework/Resources/*.lproj/myDSSSDK_Errors.strings
Languages: ru

# sdk_unsupported_certificate
source: The certificate is not intended for installation
ru: Данный сертификат не подходит для установки

# sdk_confirmation_error
source: Error has occured while confirming an operation. %@
ru: Не удалось подтвердить операцию. %@

# sdk_signing_error
source: Error has occured while signing a document. %@
ru: Не удалось подписать документы. %@

# sdk_invalid_document
source: Document(s) format is invalid
ru: Один или несколько документов имеют некорректный формат

# sdk_downloading_error
source: An error has been occured when downloading file
ru: Произошла ошибка при загрузке файла

# sdk_installing_certificates_error
source: Error(s) has occurred installing certificates: %@
ru: Возникла одна или несколько ошибок при установке сертификатов: %@

# sdk_user_is_created
source: User's status: Created
ru: Статус пользователя: Created

# sdk_user_is_installed
source: User's status is Installed
ru: Статус пользователя: Installed

# sdk_user_is_not_verified
source: User is not verified
ru: Пользователь не подтверждён

# sdk_user_is_active
source: User's status is Active
ru: Статус пользователя: Active

# sdk_user_is_expired
source: User is expired
ru: Срок действия ключей истёк

# sdk_user_is_inactive
source: User's status is Inactive
ru: Статус пользователя: Inactive

# sdk_approve_required
source: Approving is required
ru: Требуется подтверждение пользователя

# sdk_user_is_rejected
source: user is rejected
ru: Пользователь отозван

# sdk_local_keypair_is_missing
source: Local keypair is missing
ru: Отсутствует локальная ключевая пара

# sdk_internal_error
source: Internal error has occured
ru: Внутренняя ошибка

# sdk_storage_not_initialized
source: Storage is not initialized
ru: Хранилище не инициализировано

# sdk_missing_required_data
source: Reuired data is missing
ru: Отсутствуют требуемые данные

# sdk_device_properties_not_set
source: Device properties are not set
ru: Не заданы параметры устройства

# sdk_self_registration_is_forbidden
source: Self registration is forbidden
ru: Саморегистрация запрещена

# sdk_qr_type_invalid
source: QR code's type is invalid
ru: Тип QR-кода не подходит

# sdk_activation_required
source: Activation is required
ru: Требуется активация

# sdk_device_not_found
source: Device is not found
ru: Устройство не найдено

# sdk_verification_qr_value_required
source: Verification QR value is required
ru: Требуется значение QR-кода с верификацией

# sdk_verification_declined
source: Verification has been ended due to declining
ru: Подтверждение было прервано из-за отказа

# sdk_user_exists
source: User exists
ru: Пользователь существует

# sdk_user_does_not_exist
source: User does not exist
ru: Пользователь не существует

# sdk_storing_error
source: Error has occured while storing
ru: Ошибка сохранения

# sdk_key_status_invalid
source: Key status is invalid
ru: Статус ключа не верный

# sdk_key_flags_corrupted
source: Key's flags are corrupted
ru: Флаги ключа повреждены

# sdk_wrong_password
source: Password is wrong
ru: Неверный пароль

# sdk_user_is_not_activated
source: User is not activated
ru: Пользователь не активирован

# sdk_handle_invalid
source: Entering password is necessary
ru: Требуется ввод пароля

# sdk_encryption_error
source: Error has ocured while encryption
ru: Ошибка шифрования

# sdk_decryption_error
source: Error has ocured while decryption
ru: Ошибка дешифрования

# sdk_key_activation_types_are_missing
source: Key activation types are missing
ru: Тип активации ключа не указан

# sdk_operation_not_found
source: Operation is not found
ru: Операция не найдена

# sdk_canceled
source: Interaction with UI has been canceled
ru: Взаимодействие с UI прервано

# sdk_forgot_pin
source: Forgot PIN
ru: Забыл PIN-код

# sdk_wrong_qr
source: QR code is wrang
ru: QR-код не может быть использован

# sdk_client_side_keypair_does_not_exist
source: Client sign keypair does not exist
ru: Отсутствует ключевая пара для локальной подписи

# sdk_wrong_certificate_request
source: Certificate request is wrong
ru: Запрос на сертификат не подходит для подписи

# sdk_could_not_retrieve_pin
source: Couldn't retrieve biometry secured PIN. %@
ru: Не удалось получить ПИН-код защищенный биометрией. %@

# sdk_snippet_is_missing
source: Document's snippet is missing
ru: Отсутствует сниппет документа

# wrong_operation
source: Self-registration is forbidden
ru: Операция саморегистрации пользователей myDSS запрещена

# user_not_found
source: The user is not found on the server
ru: Не удалось найти пользователя по идентификатору набора ключей kid

# user_blocked
source: The user's account is blocked
ru: Учётная запись пользователя заблокирована

# requested_user_not_found
source: The user is not found
ru: Пользователь не найден

# not_unique_login
source: The user with this login already exists
ru: Пользователь с данным логином уже существует

# not_unique_device_fingerprint
source: The user with this device's fingerprint already exists
ru: Пользователь с таким отпечатком мобильного устройства уже существует

# key_not_found
source: The user does not have an assigned authentication token
ru: Пользователь не имеет назначенный токен аутентификации

source: Key expired or not yet valid
ru: Срок действия ключей аутентификации истёк или ещё не наступил

# key_already_confirmed
source: The device information is already filled in for the authentication key
ru: Информация об устройстве уже заполнена для ключа аутентификации

# invalid_login
source: The login is not specified or has an invalid format
ru: Логин не задан или имеет невалидный формат

# invalid_license
source: There is no valid license for the mobile app authentication method
ru: Отсутствует действительная лицензия на способ аутентификации через мобильное приложение

# invalid_key_id
source: Key ID (kid) not specified
ru: Идентификатор ключа (kid) не задан

# invalid_input
source: Request body is missing
ru: Отсутствует тело запроса

# invalid_kinit
source: Initialization key is invalid
ru: Некорректный ключ инициализации

# invalid_identifier
source: Information about the registered device was not sent
ru: Не передана информация о регистрируемом устройстве

# invalid_hmac
source: HMAC value is invalid
ru: Неправильное значение HMAC

# invalid_grant
source: The authentication header could not be verified
ru: Не удалось проверить заголовок аутентификации

# invalid_device_params
source: Device parameters are not valid
ru: Параметры устройства некорректны

# invalid_device_fingerprint
source: deviceFingerprint parameter is not set
ru: Параметр deviceFingerprint не задан

# invalid_authentication_scheme
source: The user is not assigned an authentication method via the mobile app
ru: Пользователю не назначен способ аутентификации через мобильное приложение

# invalid_certificate
source: The selected certificate is not valid
ru: Выбранный сертификат не подходит для подписи

# internal_error
source: Internal server error
ru: Внутренняя ошибка сервера

# existing_device_fingerprint
source: A mobile device with this fingerprint has already been added to the user
ru: Мобильное устройство с таким отпечатком уже добавлено пользователю

# device_blocked
source: Authentication on this set of keys is blocked by the operator
ru: Аутентификация на данном наборе ключей запрещена оператором

# assertion_replay
source: Repeating a query with a non-unique nonce
ru: Повторение запроса с неуникальным nonce

# operation_expired
source: Operation has been expired
ru: Срок жизни операции истёк
