Repository: MaxCode2023/nopaper-sdk-ios
Catalog: myDSSSDK.xcframework/Resources/*.lproj/myDSSSDK_UI.strings
Languages: ru

# activation_enter_code_title
source: Enter activation code
ru: Введите код активации

# password_enter_title
source: Enter PIN
ru: Введите текущий ПИН-код

# password_length
source: 6 symbols
ru: 6 символов

# password_action_forgot
source: Forgot PIN?
ru: Забыли ПИН-код?

# password_action_close
source: Close
ru: Закрыть

# password_enter_new_title
source: Enter new PIN
ru: Введите новый ПИН-код

# password_repeat_new_title
source: Repeat new PIN
ru: Повторите ПИН-код

# password_biometry_reason
source: Gaining access to the PIN
ru: Получение доступа к ПИН-коду

# password_invalid
source: Invalid PIN. You have %d attempts left Wait %d and then try again
ru: Неверный ПИН-код. Осталось попыток: %d Cможете повторить через: %d

# password_error_pass_do_not_match
source: Passwords do not match!
ru: Пароли не совпадают!

# password_error_weak_pins
source: Your PIN is too easy to guess, try set a different one
ru: Ваш ПИН-код слишком легко угадать, попробуйте установить другой

# password_action_forgot_pass
source: Forgot password?
ru: Забыли пароль?

# password_error_wrong_pass
source: Invalid password. Remaining attempts: %d
ru: Неверный пароль. Осталось попыток: %d

# password_error_repeat_pass
source: Invalid password. Next try in
ru: Неверный пароль. Следующая попытка через:

# password_error_wrong_pins
source: Invalid PIN. Remaining attempts: %d
ru: Неверный ПИН-код. Осталось попыток: %d

# password_error_repeat_pins
source: Invalid PIN. Next try in
ru: Неверный ПИН-код. Следующая попытка через

# password_label_repeat_pin
source: Repeat new PIN
ru: Повторите новый ПИН-код

# password_label_pass_instructions
source: The password must contain at least 8 characters, an uppercase letter and a number
ru: Пароль должен содержать не менее 8 символов, заглавную букву и цифру

# password_label_enter_pass
source: Enter password
ru: Введите пароль

# password_label_repeat_pass
source: Repeat new password
ru: Повторите новый пароль

# password_error_must_meet_policy
source: Password don't meet password policy
ru: Пароль не соотвествует требованиям к сложности пароля

# password_next_button
source: Continue
ru: Продолжить

# suggesting_biometry_title_faceid
source: Use Face ID to sign?
ru: Использовать Face ID для подписи?

# suggesting_biometry_title_touchid
source: Use Touch ID to sign?
ru: Использовать Touch ID для подписи?

# suggesting_biometry_action_primary
source: Yes
ru: Использовать

# suggesting_biometry_action_secondary
source: Not now
ru: Не сейчас

# documents_action_sign
source: Sign
ru: Подписать

# operation_action_primary
source: Confirm
ru: Подтвердить

# operation_action_secondary
source: Decline
ru: Отказать

# operation_action_details
source: Details
ru: Подробнее

# operation_action_close
source: Close
ru: Закрыть

# operation_list_title
source: Preview
ru: Предпросмотр

# operation_document_preview_title
source: Preview
ru: Предпросмотр

# operation_preview_options_print
source: Print version
ru: Версия для печати

# operation_preview_options_raw
source: Raw document
ru: Оригинал документа

# operation_preview_options_cancel
source: Cancel
ru: Отмена

# operation_info_title
source: Operation details
ru: Подробнее об операции

# operation_info_action_close
source: Close
ru: Закрыть

# operation_no_certificate_title
source: You don't have an active certificate to sign
ru: Нет активного сертификата для подписания

# operation_no_certificate_message
source: The document can be only rejected
ru: Доступно только отклонение документа

# operation_decline_warning_message
source: Do you really want to deny selected documents?
ru: Вы действительно хотите отказаться от подписи выбранных документов?

# operation_decline_warning_action
source: Deny
ru: Отказаться

# operation_decline_warning_cancel
source: Cancel
ru: Отменить

# operation_error_alert_close
source: Close
ru: Закрыть

# operation_pdf_preview_close
source: Close
ru: Закрыть

# operation_documents_selected
source: Selected: %d of %d
ru: Выбрано: %d из %d

# accept_account_changes_title
source: Confirm using this device to sign documents
ru: Подтвердите использование данного устройства для подписания документов электронной подписью

# accept_account_changes_action_primary
source: Confirm
ru: Подтвердить

# accept_account_changes_action_secondary
source: Decline
ru: Отклонить

# accept_account_changes_action_close
source: Close
ru: Закрыть

# process_device_approve_title
source: Confirm adding the device
ru: Подтвердите добавление устройства

# process_device_action_primary
source: Confirm
ru: Подтвердить

# process_device_action_secondary
source: Deny
ru: Отказать

# process_device_action_close
source: Close
ru: Закрыть

# approving_qr_title
source: Scan QR code on the first device
ru: Отсканируйте QR-код на первом устройстве

# approving_qr_action_primary
source: Done
ru: Готово

# approving_qr_action_secondary
source: Later
ru: Позже

# approving_qr_action_close
source: Close
ru: Закрыть

# camera_action_close
source: Close
ru: Закрыть

# camera_action_cancel
source: Cancel
ru: Отменить

# camera_action_settings
source: Settings
ru: Настройки

# camera_status_show_qr
source: Focus your camera on the QR-code
ru: Наведите камеру на QR-код

# camera_status_not_available
source: Camera is not available
ru: Нет доступа к камере

# camera_status_not_found
source: Camera is not found
ru: Камера не найдена

# camera_status_configuration_error
source: Camera configuration error
ru: Ошибка конфигурации камеры

# camera_status_wrong_qr
source: QR code is wrong
ru: QR-код не может быть использован

# camera_authorization_title
source: Allow access to a camera
ru: Разрешите доступ к камере

# camera_authorization_description
source: To scan a QR-code, youâ€™ll need a camera access. Please, turn on your camera in Settings
ru: Для сканирования QR-кодов нужен доступ к камере. Вы можете включить его в Настройках
